In [47]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [48]:
data = pd.read_csv('titanic.csv')
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [49]:
d_data = data.drop(['PassengerId', 'Embarked', 'Name', 'Ticket'], axis=1)
d_data

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare Cabin
0           0       3    male  22.0      1      0   7.2500   NaN
1           1       1  female  38.0      1      0  71.2833   C85
2           1       3  female  26.0      0      0   7.9250   NaN
3           1       1  female  35.0      1      0  53.1000  C123
4           0       3    male  35.0      0      0   8.0500   NaN
..        ...     ...     ...   ...    ...    ...      ...   ...
886         0       2    male  27.0      0      0  13.0000   NaN
887         1       1  female  19.0      0      0  30.0000   B42
888         0       3  female   NaN      1      2  23.4500   NaN
889         1       1    male  26.0      0      0  30.0000  C148
890         0       3    male  32.0      0      0   7.7500   NaN

[891 rows x 8 columns]

In [56]:
d_data['Survived'].value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

### 0 - Not Survived
### 1 - Survived

In [50]:
d_data['Pclass'].value_counts()

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

### Split data by `Pclass`

In [51]:
first_class = d_data[d_data['Pclass'] == 1]
second_class = d_data[d_data['Pclass'] == 2]
third_class = d_data[d_data['Pclass'] == 3]

In [60]:
first_class['Survived'].value_counts()

Survived
1    136
0     80
Name: count, dtype: int64

In [69]:
round((len(first_class[first_class['Survived'] == 1]) / len(first_class['Survived'])) * 100, 2)

62.96

In [61]:
second_class['Survived'].value_counts()

Survived
0    97
1    87
Name: count, dtype: int64

In [70]:
round((len(second_class[second_class['Survived'] == 1]) / len(second_class['Survived'])) * 100, 2)

47.28

In [72]:
third_class['Survived'].value_counts()

Survived
0    372
1    119
Name: count, dtype: int64

In [71]:
round((len(third_class[third_class['Survived'] == 1]) / len(third_class['Survived'])) * 100, 2)

24.24